Courses/7140/Lectures/Implementation/Testing/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Software Testing</title>
<!-- 2016-03-23 Wed 14:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Software Testing</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview/Goals</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>You may have understood testing on very intuitive basis
</li>
<li>Make this understanding more rigorous
</li>
<li>Software testing v testing in engineering
</li>

<li>Software Test Design Goal: "hope" to fail
</li>
</ol>
<blockquote>
<p>
"Testing shows the presence, not the absence, of bugs"
&#x2013; Edsger W. Dijkstra, 1969, Turning Award Winner 1972
</p>
</blockquote>
<ol class="org-ol">
<li>Goal of Debugging: Identify the location where errant behavior begins
<ol class="org-ol">
<li>Definition of a "Errant Behavior"
</li>
<li>Can we recognize errant behavior?  How soon?
</li>
</ol>
</li>

<li>Repeatability of Tests
<ol class="org-ol">
<li>In the presence of concurrency
</li>
</ol>
</li>

<li>Test Suites
<ol class="org-ol">
<li><a href="http://en.wikipedia.org/wiki/Smoke_testing">"Smoke" Test</a> description on Wikipedia
</li>
<li>Conformance/ Acceptance Tests
</li>
<li><a href="http://en.wikipedia.org/wiki/Regression_testing">Regression</a> description on Wikipedia
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Definition of a "Test"</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>test io pair: input and its <b>expected</b> output
<ol class="org-ol">
<li>"test vector" refers to the inputs given at one time
</li>
</ol>
</li>
<li>input includes: actual arguments, state of files, databases, &#x2026;
<ol class="org-ol">
<li>everything the program "reads"
</li>
</ol>
</li>
<li>output: as above
<ol class="org-ol">
<li>everything the program "writes"
</li>
</ol>
</li>
<li>test fails if <b>observed</b> output != expected
</li>
<li>hangs v crashes; both =&gt; fail
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Test Generation</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Generate the io pairs, with high likelihood of test failures
</li>
<li>Assume for now that input is text, and the output is text
</li>
<li>when it is a test of an "internal" component, the io may not be a
"text/text" pair
<ol class="org-ol">
<li>Unit testing solves this problem
</li>
</ol>
</li>
<li>Considerable research on: Formal specs  =&gt; Tests

<ol class="org-ol">
<li>Offutt, Jeff, and Aynur Abdurazik. "Generating tests from UML
specifications." In «UML»’99—The Unified Modeling Language,
pp. 416-429. Springer Berlin Heidelberg, 1999.  Reference
</li>

<li>Pradel, Michael, and Thomas R. Gross. "Leveraging test
generation and specification mining for automated bug
detection without false positives." In 34th International
Conference on Software Engineering (ICSE),
pp. 288-298. IEEE, 2012.  Reference
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Test Coverage</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Can we construct tests that exercise every line of code?
</li>
<li>Statement coverage: execute each statement (at least) once
</li>
<li>Branch coverage: Execute each branch after a condition statement
</li>
<li>Path coverage: Execute all paths through the code
</li>
<li>Tools to track coverage
<ol class="org-ol">
<li>C/C++: gprof, gcov/lcov, googletest, &#x2026;
</li>
<li>Java: eCobertura, <a href="http://codecover.org/">CodeCover</a>, EclEmma  
</li>
</ol>
</li>
<li>Does 100% coverage and no failures, guarantee that software is
fault-free?
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Testing Techniques</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Black box testing (aka functional testing): Uses no info re internals
</li>
<li>White box testing (aka structural testing): Uses all info re internals
</li>
<li>Worst/Special Case Testing
<ol class="org-ol">
<li>Errors seem to cluster at boundaries
</li>
<li>What if values fall outside their ranges
</li>
<li>"Torture" (Stress) Tests 
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Equivalence Class Testing</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Goal: Reduction of human/computer testing effort
</li>
<li>Divide the test vectors into subsets so that test coverage is the same
</li>
<li>The program is likely constructed so that it either succeeds or 
fails for each of the values in that class
</li>
<li>To test for robustness: for each equivalence class of valid
inputs, devise equivalence classes of invalid inputs
</li>
<li>"cover" a class: Construct tests choosing one value from the class
</li>
<li>The goal is to cover all equivalence classes
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Unit testing, Integration Testing</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>OOP and programming language (PL) neutral term "unit"  cf. class, method
</li>
<li>Unit test: test one method of one isolated class with one thread
</li>
<li>Tools for unit testing: JUnit and TestNG (both for any JVM based PL)
</li>
<li>Integration test: Test (all) the units together. It occurs after
unit testing and before validation testing.
</li>
<li>see separate lectures
<ol class="org-ol">
<li><a href="./testing-units.html">./testing-units.html</a>
</li>
<li><a href="./testing-integrated.html">./testing-integrated.html</a>
</li>
</ol>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Testing of Interactive Programs</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>Input generated in "real" time
</li>
<li>Output observed in "real" time
</li>
<li>Correctness judgement?
</li>
<li>Book: Don Libes, "Exploring Expect: A Tcl-based Toolkit for
Automating Interactive Programs", O'Reilly Media, Inc., 2010, 606
pages.  Look it up in WSU Library Safari Books.
</li>
<li>The "expect" is a standard package in Debian/Ubuntu systems
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Mutation Testing</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>How "good" are the tests?  Suppose we alter the source code, and
apply the same tests.  Do the results change?
</li>
<li>Simple Source Code Mutations
<ol class="org-ol">
<li>Replace &amp;&amp; in boolexp with ||
</li>
<li>Replace if B then S fi with while B do S od
</li>
<li>Exchange parameters/args (of the same type)
</li>
</ol>
</li>
<li>Does a test distingguish actual software S from a mutated S'.
</li>
<li><a href="http://en.wikipedia.org/wiki/Mutation_testing">http://en.wikipedia.org/wiki/Mutation_testing</a>  Required Reading.
</li>
<li>IntelliJ IDEA + Eclipse plugin <a href="http://pitest.org/quickstart/mutators/">http://pitest.org/quickstart/mutators/</a>
</li>
<li>Eclipse Plugin <a href="http://muclipse.sourceforge.net/">http://muclipse.sourceforge.net/</a>
<ol class="org-ol">
<li>inactive 2011; so activate it!
</li>
<li><a href="http://cs.gmu.edu/~offutt/mujava/">http://cs.gmu.edu/~offutt/mujava/</a> is "a mutation system for Java
programs. It automatically generates mutants for both
traditional mutation testing and class-level mutation
testing. µJava can test individual classes and packages
&#x2026; encapsulated in methods in JUnit classes."
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Reference</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>Glenford J. Myers, The Art of Software Testing, Second
Edition Revised and Updated by Tom Badgett and Todd M. Thomas with
Corey Sandler John Wiley &amp; Sons, Inc.  2004. Reference.
</li>
<li><a href="http://en.wikipedia.org/wiki/Mutation_testing">http://en.wikipedia.org/wiki/Mutation_testing</a>  Required Reading.
</li>
<li>Pfleeger and Atlee, Software Engineering, chapters on Testing.
Slides.  Required Reading.
<ol class="org-ol">
<li><a href="http://wps.prenhall.com/esm_pfleeger_softengtp_4/">http://wps.prenhall.com/esm_pfleeger_softengtp_4/</a>
</li>
<li><a href="./PA-chapter08-Testing.ppt">./PA-chapter08-Testing.ppt</a>
</li>
<li><a href="./PA-chapter09-TestingTheSystem.ppt">./PA-chapter09-TestingTheSystem.ppt</a>
</li>
</ol>
</li>

<li><a href="http://courses.cs.washington.edu/courses/cse331/16wi/L08/L08-Testing.pdf">http://courses.cs.washington.edu/courses/cse331/16wi/L08/L08-Testing.pdf</a>
   Reference
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  
</div>
</body>
</html>
